Repository: olivierh65/media_drop
Catalog: translations/*.po
Languages: fr

source: Media Details
fr: Détails du média

source: A custom field that displays filtered media information for each media.
fr: Un champ personnalisé qui affiche les informations de média filtrées pour chaque média.

source: A new media has been uploaded to the album "@album".
fr: Un nouveau média a été téléchargé dans l'album "@album".

source: @file_count file@plurial uploaded by @user
fr: @file_count fichier@plurial téléchargé@plurial par @user

source: Manage your media at: @url
fr: Gérer les médias à @url

source: The media management view has been created.
fr: La vue de gestion des médias a été créée.

source: Media Drop has been installed successfully. Configure it at Admin > Configuration > Media > Media Drop.
fr: Media Drop a été installé avec succès. Configurez-le à Admin > Configuration > Médias > Media Drop.

source: Added media type and directory fields to albums table.
fr: Champs de type média et répertoire ajoutés à la table des albums.

source: Install Views Bulk Operations to use bulk media management: composer require drupal/views_bulk_operations
fr: Installez Views Bulk Operations pour utiliser la gestion des médias en masse : composer require drupal/views_bulk_operations

source: Views Bulk Operations is not installed.
fr: Views Bulk Operations n'est pas installé.

source: Media management view enabled. Clear cache with drush cr.
fr: Vue de gestion des médias activée. Videz le cache avec drush cr.

source: Field auto_create_structure added to albums table.
fr: Champ auto_create_structure ajouté à la table des albums.

source: Notification field renamed from groups to roles.
fr: Champ de notification renommé de groups en roles

source: Allows users to bulk upload photos and videos into organized albums with media type management
fr: Permet aux utilisateurs de télécharger en masse des photos et des vidéos dans des albums organisés avec gestion des types de médias

source: Media
fr: Médias

source: Add album
fr: Ajouter un album

source: Manage MIME mappings
fr: Gérer les mappages MIME

source: Manage media
fr: Gérer les médias

source: MIME Mappings
fr: Mappages MIME

source: Settings
fr: Paramètres

source: Manage media drop albums
fr: Gérer les albums de téléchargement de médias

source: Manage drop albums
fr: Gérer les albums de dépôt

source: Move and manage uploaded media in bulk
fr: Déplacer et gérer les médias téléchargés en masse

source: Configure mappings between MIME types and media types
fr: Configurer les mappages entre les types MIME et les types de médias

source: Configure general settings
fr: Configurer les paramètres généraux

source: Administer Media Drop
fr: Administrer Media Drop

source: Manage albums, settings, and media type mappings
fr: Gérer les albums, les paramètres et les mappages de types de médias

source: Upload media to albums
fr: Télécharger des médias dans les albums

source: Allows uploading files to albums
fr: Permet de télécharger des fichiers dans les albums

source: View own media
fr: Voir ses propres médias

source: Allows viewing media that the user has uploaded
fr: Permet de voir les médias que l'utilisateur a téléchargés

source: Delete own media
fr: Supprimer ses propres médias

source: Allows deleting media that the user has uploaded
fr: Permet de supprimer les médias que l'utilisateur a téléchargés

source: Create subfolders in albums
fr: Créer des sous-dossiers dans les albums

source: Allows creating subfolders to organize media
fr: Permet de créer des sous-dossiers pour organiser les médias

source: Media Drop Settings
fr: Paramètres de Media Drop

source: Add an album
fr: Ajouter un album

source: Edit an album
fr: Modifier un album

source: Delete an album
fr: Supprimer un album

source: MIME type mapping
fr: Mappage de type MIME

source: Create view
fr: Créer une vue

source: Drop media
fr: Déposer des médias

source: List Folders
fr: Lister les dossiers

source: Drag and drop your files here
fr: Glissez-déposez vos fichiers ici

source: Your browser does not support drag'n'drop
fr: Votre navigateur ne supporte pas le glisser-déposer

source: File is too big (max: {{maxFilesize}}MB)
fr: Le fichier est trop volumineux (max : {{maxFilesize}}MB)

source: Invalid file type
fr: Type de fichier invalide

source: Remove
fr: Supprimer

source: Cancel
fr: Annuler

source: Please enter your name before dropping files.
fr: Veuillez entrer votre nom avant de déposer des fichiers.

source: File uploaded successfully
fr: Fichier téléchargé avec succès

source: Error during upload
fr: Erreur lors du téléchargement

source: Please save your name first.
fr: Veuillez d'abord enregistrer votre nom.

source: Please enter a folder name.
fr: Veuillez entrer un nom de dossier.

source: Folder created
fr: Dossier créé

source: Error creating folder
fr: Erreur lors de la création du dossier

source: No media dropped yet.
fr: Aucun média déposé pour le moment.

source: Delete
fr: Supprimer

source: Are you sure you want to delete this media?
fr: Êtes-vous sûr de vouloir supprimer ce média ?

source: Media deleted
fr: Média supprimé

source: Error during deletion
fr: Erreur lors de la suppression

source: Active
fr: Actif

source: Inactive
fr: Inactif

source: Edit
fr: Modifier

source: Name
fr: Nom

source: Directory
fr: Répertoire

source: Media types
fr: Types de médias

source: Drop URL
fr: URL de dépôt

source: Uploads
fr: Téléchargements

source: Status
fr: Statut

source: Created
fr: Créé

source: Operations
fr: Opérations

source: No albums created yet. @link
fr: Aucun album créé pour le moment. @link

source: Create an album
fr: Créer un album

source: Images: default mapping
fr: Images : mappage par défaut

source: Videos
fr: Vidéos

source: Videos: default mapping
fr: Vidéos : mappage par défaut

source: The <a href="@url" target="_blank">Views Bulk Operations</a> module must be installed to use this functionality.
fr: Le module <a href="@url" target="_blank">Views Bulk Operations</a> doit être installé pour utiliser cette fonctionnalité.

source: The media management view does not exist yet.
fr: La vue de gestion des médias n'existe pas encore.

source: Create the view automatically
fr: Créer la vue automatiquement

source: Create the view now
fr: Créer la vue maintenant

source: Click this button to automatically create the media management view.
fr: Cliquez sur ce bouton pour créer automatiquement la vue de gestion des médias.

source: Or import manually
fr: Ou importer manuellement

source: Go to <a href="/admin/config/development/configuration/single/import">Configuration > Single import</a>
fr: Allez à <a href="/admin/config/development/configuration/single/import">Configuration > Importer simple</a>

source: Configuration type: <strong>View</strong>
fr: Type de configuration : <strong>Vue</strong>

source: Paste the content of the file <code>views.view.media_drop_manage.yml</code>
fr: Collez le contenu du fichier <code>views.view.media_drop_manage.yml</code>

source: Click "Import"
fr: Cliquez sur "Importer"

source: Manual management
fr: Gestion manuelle

source: In the meantime, you can manage media via:
fr: En attendant, vous pouvez gérer les médias via :

source: Drupal media list
fr: Liste des médias Drupal

source: Create the view manually
fr: Créer la vue manuellement

source: Error loading the view.
fr: Erreur lors du chargement de la vue.

source: The view has been created successfully!
fr: La vue a été créée avec succès !

source: Error creating the view: @error
fr: Erreur lors de la création de la vue : @error

source: View configuration file not found: @file
fr: Fichier de configuration de la vue introuvable : @file

source: Unable to parse the view configuration file.
fr: Impossible de parser le fichier de configuration de la vue.

source: Album not found or inactive.
fr: Album non trouvé ou inactif.

source: Drop your media: @album
fr: Déposez vos médias : @album

source: Your name
fr: Votre identifiant

source: Enter your name
fr: Entrez votre nom

source: Save
fr: Enregistrer

source: Organize in a sub-folder (optional)
fr: Organiser dans un sous-dossier (optionnel)

source: -- Main folder --
fr: -- Dossier principal --

source: Create folder
fr: Créer un dossier

source: Folder name
fr: Nom du dossier

source: Create
fr: Créer

source: Drag and drop your photos and videos here or click to select
fr: Glissez-déposez vos photos et vidéos ici ou cliquez pour sélectionner

source: You do not have permission to drop media.
fr: Vous n'avez pas la permission de déposer des médias.

source: Your dropped media
fr: Vos médias déposés

source: Album not found.
fr: Album non trouvé.

source: Permission denied.
fr: Permission refusée.

source: Please enter your name.
fr: Veuillez entrer votre nom.

source: Unsupported file type: @mime
fr: Type de fichier non supporté : @mime

source: Error saving the file.
fr: Erreur lors de l'enregistrement du fichier.

source: User name required.
fr: Nom requis

source: Configure the general settings for Media Drop. To manage albums and MIME type mappings, use the tabs above.
fr: Configurez les paramètres généraux de Media Drop. Pour gérer les albums et les mappages de types MIME, utilisez les onglets ci-dessus.

source: Manage albums
fr: Gérer les albums

source: Create and manage your drop albums.
fr: Créez et gérez vos albums de dépôt.

source: MIME Types
fr: Types MIME

source: Configure the media types created based on the MIME types of the files.
fr: Configurez les types de médias créés en fonction des types MIME des fichiers.

source: Upload
fr: Téléchargement

source: Maximum file size
fr: Taille maximale du fichier

source: Maximum size in MB for each file. Default: 50 MB
fr: Taille maximale en MB pour chaque fichier. Par défaut : 50 MB

source: Allowed extensions
fr: Extensions autorisées

source: List of allowed file extensions, separated by spaces.
fr: Liste des extensions de fichiers autorisées, séparées par des espaces.

source: Enable image preview
fr: Activer l'aperçu des images

source: Display image thumbnails in the upload interface.
fr: Afficher les vignettes d'images dans l'interface de téléchargement.

source: Security
fr: Sécurité

source: Name required for anonymous users
fr: Nom requis pour les utilisateurs anonymes

source: Anonymous users must enter their name.
fr: Les utilisateurs anonymes doivent entrer leur nom.

source: Album token lifetime
fr: Durée de vie du jeton d'album

source: Unlimited
fr: Illimité

source: 30 days
fr: 30 jours

source: 90 days
fr: 90 jours

source: 180 days
fr: 180 jours

source: 1 year
fr: 1 an

source: After this period, album URLs will be invalid and will need to be regenerated.
fr: Après cette période, les URL de l'album seront invalides et devront être régénérées.

source: The maximum size must be a positive number.
fr: La taille maximale doit être un nombre positif.

source: Warning: this album contains @count media item(s). The media themselves will not be deleted, but the links with this album will be lost.
fr: Attention : cet album contient @count élément(s) média. Les médias eux-mêmes ne seront pas supprimés, mais les liens avec cet album seront perdus.

source: Are you sure you want to delete the album %name?
fr: Êtes-vous sûr de vouloir supprimer l'album %name ?

source: This action cannot be undone. The base directory and files will not be deleted.
fr: Cette action ne peut pas être annulée. Le répertoire de base et les fichiers ne seront pas supprimés.

source: The album %name has been deleted.
fr: L'album %name a été supprimé.

source: Album name
fr: Nom de l'album

source: Example: Birthday 2025, Sophie & Pierre's wedding
fr: Exemple : Anniversaire 2025, mariage de Sophie et Pierre

source: Select the media types to create for uploaded files. If not specified, the system will use the default MIME mapping.
fr: Sélectionnez les types de médias à créer pour les fichiers téléchargés. S'il n'est pas spécifié, le système utilisera le mappage MIME par défaut.

source: Media type for images
fr: Type de média pour les images

source: - Use default MIME mapping -
fr: - Utiliser le mappage MIME par défaut -

source: Drupal media type that will be created for image files (JPEG, PNG, etc.)
fr: Type de média Drupal qui sera créé pour les fichiers image (JPEG, PNG, etc.)

source: Media type for videos
fr: Type de média pour les vidéos

source: Drupal media type that will be created for video files (MP4, MOV, etc.)
fr: Type de média Drupal qui sera créé pour les fichiers vidéo (MP4, MOV, etc.)

source: Directories
fr: Répertoires

source: Storage directory
fr: Répertoire de stockage

source: Example: public://media-drop/birthday2025<br>Media will be saved in subfolders by user.
fr: Exemple : public://media-drop/birthday2025<br>Les médias seront enregistrés dans des sous-dossiers par utilisateur.

source: Directory in Media Browser
fr: Répertoire dans le navigateur de médias

source: Optional path in the Media Browser to organize media (e.g: /albums/birthday2025).<br>Leave empty to use root.
fr: Chemin optionnel dans le navigateur de médias pour organiser les médias (par ex. : /albums/birthday2025).<br>Laissez vide pour utiliser la racine.

source: Media Directories
fr: Répertoires de médias

source: - Root -
fr: - Racine -

source: Select the Media Directories taxonomy term where uploaded media will be classified.<br>This taxonomy is used by the Media Directories module to organize media.
fr: Sélectionnez le terme de taxonomie Media Directories où les médias téléchargés seront classifiés.<br>Cette taxonomie est utilisée par le module Media Directories pour organiser les médias.

source: Create a new directory
fr: Créer un nouveau répertoire

source: Name of new directory
fr: Nom du nouveau répertoire

source: If you want to create a new directory in Media Directories, enter its name here.
fr: Si vous souhaitez créer un nouveau répertoire dans Media Directories, entrez son nom ici.

source: Parent directory
fr: Répertoire parent

source: Under which directory to create the new directory.
fr: Sous quel répertoire créer le nouveau répertoire.

source: Automatically create structure
fr: Créer automatiquement la structure

source: If checked, user folders and subfolders will be automatically added to the Media Directories taxonomy during uploads.
fr: Si coché, les dossiers d'utilisateurs et les sous-dossiers seront automatiquement ajoutés à la taxonomie Media Directories lors des téléchargements.

source: The Media Directories module is enabled but no taxonomy is configured. Please configure Media Directories first.
fr: Le module Media Directories est activé mais aucune taxonomie n'est configurée. Veuillez d'abord configurer Media Directories.

source: Share this URL with participants so they can drop their media.
fr: Partagez cette URL avec les participants pour qu'ils puissent déposer leurs médias.

source: Regenerate token (will change the URL)
fr: Régénérer le jeton (changera l'URL)

source: Check this box to generate a new URL. The old URL will no longer work.
fr: Cochez cette case pour générer une nouvelle URL. L'ancienne URL ne fonctionnera plus.

source: Enable email notifications
fr: Activer les notifications par mail

source: Send email notifications when media is uploaded to this album.
fr: Envoi d'une notification quand un media est envoyé vers cet album.

source: Notify roles
fr: Role destinataire

source: Select which roles should receive email notifications about uploads to this album.
fr: Sélectionnez quel role devra recevoir les emails de notification

source: Additional notification email
fr: Email additionnel de notification

source: Optional: Send notifications to this email address in addition to users with selected roles.
fr: Optionnel: Envoi d'une notification a cette adresse en plus des utilisateurs du rôle sélectionné.

source: Album active
fr: Album actif

source: If unchecked, the album will no longer be accessible for drops.
fr: Si décoché, l'album ne sera plus accessible pour les dépôts.

source: Update
fr: Mettre à jour

source: The directory must start with public:// or private://
fr: Le répertoire doit commencer par public:// ou private://

source: The directory name cannot be empty.
fr: Le nom du répertoire ne peut pas être vide.

source: The directory "@name" has been created.
fr: Le répertoire "@name" a été créé.

source: The album has been updated.
fr: L'album a été mis à jour.

source: The album and "Directories" structure have been created automatically.
fr: L'album et la structure "Répertoires" ont été créés automatiquement.

source: The album has been created but the directory structure could not be created: @error
fr: L'album a été créé mais la structure du répertoire n'a pas pu être créée : @error

source: The album has been created.
fr: L'album a été créé.

source: Files
fr: Fichiers

source: Configure which Drupal media types will be created based on the MIME types of uploaded files. Custom media types are also available.
fr: Configurez les types de médias Drupal qui seront créés en fonction des types MIME des fichiers téléchargés. Les types de médias personnalisés sont également disponibles.

source: MIME Type
fr: Type MIME

source: Drupal Media Type
fr: Type de média Drupal

source: Weight
fr: Poids

source: No mappings configured.
fr: Aucun mappage configuré.

source: Add a new mapping
fr: Ajouter un nouveau mappage

source: Example: image/heic, video/mov
fr: Exemple : image/heic, video/mov

source: - Select -
fr: - Sélectionner -

source: Please select a media type.
fr: Veuillez sélectionner un type de média.

source: Please enter a MIME type.
fr: Veuillez entrer un type MIME.

source: This MIME type already exists.
fr: Ce type MIME existe déjà.

source: The mappings have been saved.
fr: Les mappages ont été enregistrés.

source: The fields below show values common to selected media. Media with the same values are grouped together.
fr: Les champs ci-dessous affichent les valeurs communes aux médias sélectionnés. Les médias avec les mêmes valeurs sont regroupés.

source: Selection summary (@count media)
fr: Résumé de la sélection (@count médias)

source: Modify fields
fr: Modifier les champs

source: Modify this field
fr: Modifier ce champ

source: Clear this field
fr: Effacer ce champ

source: No values
fr: Aucune valeur

source: Common value: <strong>@value</strong> (@count media)
fr: Valeur commune : <strong>@value</strong> (@count médias)

source: Multiple values:
fr: Valeurs multiples :

source: New value
fr: Nouvelle valeur

source: Enable
fr: Activer

source: Field type: @type
fr: Type de champ : @type

source: Edit media (grouped)
fr: Modifier les médias (regroupés)

source: The Media Directories module must be enabled to use this action.
fr: Le module Media Directories doit être activé pour utiliser cette action.

source: No taxonomy configured in Media Directories.
fr: Aucune taxonomie configurée dans Media Directories.

source: - Root (no directory) -
fr: - Racine (aucun répertoire) -

source: Destination directory
fr: Répertoire de destination

source: The selected media will be <strong>moved</strong> (not copied) to this directory.
fr: Les médias sélectionnés seront <strong>déplacés</strong> (non copiés) vers ce répertoire.

source: The media @name does not have a "directory" field.
fr: Le média @name n'a pas de champ "répertoire".

source: Move to directory
fr: Déplacer vers un répertoire

source: Yes
fr: Oui

source: No
fr: Non
